code-examples/promjena-nacina-placanja-s-elektronickim-potpisom-98-zahtjev.xml

<?xml version="1.0" encoding="UTF-8"?>  
<soapenv:Envelope  xmlns:xd ="http://www.w3.org/2000/09/xmldsig# " xmlns:tns ="http://www.apis-
it.hr/fin/2012/types/f73 " xmlns:soapenv ="http://schemas.xmlsoap.org/soap/envelope/ "> 
<soapenv:Header /> 
<soapenv:Body> 
<tns:PromijeniNacPlacZahtjev  Id="promijeniNacPlac "> 
<tns:Zaglavlje> 
<tns:IdPoruke>c04d7e5d-3192-4385-aa99-be8d2ea0575a </tns:IdPoruke> 
<tns:DatumVrijeme>25.11.2021T12:06:03 </tns:DatumVrijeme> 
</tns:Zaglavlje> 
<tns:Racun> 
<tns:Oib>02994650199 </tns:Oib> 
<tns:USustPdv>false</tns:USustPdv> 
<tns:DatVrijeme>25.11.2021T12:01:03 </tns:DatVrijeme> 
<tns:OznSlijed>P</tns:OznSlijed> 
<tns:BrRac> 
<tns:BrOznRac>070997 </tns:BrOznRac> 
<tns:OznPosPr>POSL1</tns:OznPosPr> 
<tns:OznNapUr>12</tns:OznNapUr> 
</tns:BrRac> 
<tns:Pnp> 
<tns:Porez> 
<tns:Stopa>2.00</tns:Stopa> 
<tns:Osnovica>410.02 </tns:Osnovica> 
<tns:Iznos>8.20</tns:Iznos> 
</tns:Porez> 
</tns:Pnp> 
<tns:Naknade> 
<tns:Naknada> 
<tns:NazivN>Povratna naknada </tns:NazivN> 
<tns:IznosN>7.73</tns:IznosN> 
</tns:Naknada> 
</tns:Naknade> 
<tns:IznosUkupno>4740.57 </tns:IznosUkupno> 
<tns:NacinPlac>K</tns:NacinPlac> 
<tns:OibOper>01234567890 </tns:OibOper> 
<tns:ZastKod>39e2235e91ce78b7f5d3aab1e0db83e4 </tns:ZastKod> 
<tns:NakDost>false</tns:NakDost> 
<tns:PromijenjeniNacinPlac>G</tns:PromijenjeniNacinPlac> 
</tns:Racun> 
<Signature  xmlns="http://www.w3.org/2000/09/xmldsig# "> 
<SignedInfo> 
<CanonicalizationMethod  Algorithm ="http://www.w3.org/2001/10/xml-exc-c14n#"/> 
<SignatureMethod  Algorithm ="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/> 
<Reference  URI="#promijeniNacPlac "> 
<Transforms> 
<Transform  Algorithm ="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>< Transform  
Algorithm ="http://www.w3.org/2001/10/xml-exc-c14n#"/> 
</Transforms> 
<DigestMethod  Algorithm ="http://www.w3.org/2000/09/xmldsig#sha1"/> 
<DigestValue>11iNas18QKf08ia4ajPOAIKrAKk= </DigestValue> 
</Reference> 
</SignedInfo> 
<SignatureValue>MY9fqQi0SNc6kjVQwFuwRH/AaKPv1p8wD4Wkj8mV5fwX6t7QIb9OFRfBUg89Kg+xSePU
TllSJWmX 
XtbSCfNoIDbISib2T6wXBLmWKqV77epzApXkM686drMX3uQAntrJk+rpnddHgCdi56+JPTtUO+7H 
q5305VaYzycw9dIn3nXqK0Rz/1GPr/FMorvBcJuzUr4kX53NMPf8VRAAAirKiNAzgDDHaNXO8Vkf 
biJ9rxaifz8WOhvnzYOBXLWHax9D4nu1RRvNyidH34KBXn/GvrWT6BpF8FdjOXvENSe7MRnfnbF0 
DbBYlrgvne+BDN+HNt1SFfS6kjFG+iFFvGLmsA== </SignatureValue> 
<KeyInfo> 
<X509Data> 
<X509Certificate>MIIGjzCCBHegAwIBAgIQVMN+ETtXRMMAAAAAXyRDJDANBgkqhkiG9w0BAQsFADBIMQ
swCQYDVQQG 
EwJIUjEdMBsGA1UEChMURmluYW5jaWpza2EgYWdlbmNpamExGjAYBgNVBAMTEUZpbmEgRGVtbyBD 
QSAyMDIwMB4XDTIxMTAxOTA4MjY1NloXDTI2MTAxOTA4MjY1NlowWDELMAkGA1UEBhMCSFIxJTAj 
BgNVBAoTHEFQSVMgSVQgRC5PLk8uIEhSMDI5OTQ2NTAxOTkxDzANBgNVBAcTBlpBR1JFQjERMA8G 
A1UEAxMIRklTS0FMIDMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCnVrIj9eExiFKX 
TB/t6eMBcb6IqzgmHMrJ6L5r5bUbcg7clP1OTfrOItMyUf2cVAl7B3gjS7rE1Y4LcnApYbx2Mzhf 
wi/ogmruJpdox32J8LG/1GmOW96Q9zJ/BlqLBrOBAmQ1i69QonilnbwQWi+XKqMRAqtNkJud6G44 
04kWiDgdXT6obZshJQaimG4dVd/bBxliGNKPg9nK6ZI2Ng4Vy075ajRe3bq8NseNhlCLB26UL1WS 
hkDNpGYTiN8K8Xyx7JFNpytC3ufS5PhPM8TLjJUYARrACC/CxHulWavJd4qVM/8ZYlORhJbBuc1d 
jjpyGsqVgYq5LED51jSCdV8XAgMBAAGjggJjMIICXzAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYw 
FAYIKwYBBQUHAwQGCCsGAQUFBwMCMIGsBgNVHSAEgaQwgaEwgZQGCSt8iFAFIQ8DATCBhjBBBggr 
BgEFBQcCARY1aHR0cDovL2RlbW8tcGtpLmZpbmEuaHIvY3BzL2Nwc25xY2RlbW8yMDE0djItMC1o 
ci5wZGYwQQYIKwYBBQUHAgEWNWh0dHA6Ly9kZW1vLXBraS5maW5hLmhyL2Nwcy9jcHNucWNkZW1v 
MjAxNHYyLTAtZW4ucGRmMAgGBgQAj3oBATB9BggrBgEFBQcBAQRxMG8wKAYIKwYBBQUHMAGGHGh0 
dHA6Ly9kZW1vMjAxNC1vY3NwLmZpbmEuaHIwQwYIKwYBBQUHMAKGN2h0dHA6Ly9kZW1vLXBraS5m 
aW5hLmhyL2NlcnRpZmlrYXRpL2RlbW8yMDIwX3N1Yl9jYS5jZXIwgbQGA1UdHwSBrDCBqTCBpqCB 
o6CBoIYoaHR0cDovL2RlbW8tcGtpLmZpbmEuaHIvY3JsL2RlbW8yMDIwLmNybIZ0bGRhcDovL2Rl 
bW8tbGRhcC5maW5hLmhyL2NuPUZpbmElMjBEZW1vJTIwQ0ElMjAyMDIwLG89RmluYW5jaWpza2El 
MjBhZ2VuY2lqYSxjPUhSP2NlcnRpZmljYXRlUmV2b2NhdGlvbkxpc3QlM0JiaW5hcnkwHwYDVR0j 
BBgwFoAUla9S1cLp1zeEPm5Jj8kf6lwrX88wHQYDVR0OBBYEFHbh5aGV7SnN828H+8jZ/1kRMgkm 
MAkGA1UdEwQCMAAwDQYJKoZIhvcNAQELBQADggIBAGZLzwPNAnhYAESsDRLdnZ/7a7uoKLOTh0hN 
UgqESGOkB8xcuQFHHKLwQlmFdv+/2i3WPT4aXg0PNPFIlNLABIlnZEJfhpAsnswCBcZfBMTFqmOU 
lJkQIghSSVHm7yC2eJBiB9x/PnZQzd2FteHOprT5exd2wvHIhQEtmLDpI+hDNv6zvBxrRcz6aT4v 
5KfmkP5O4z1jj5y4Ug5Su7TX2KpT/zRNPPPQXsqg+dS+6C+FJFG7UFRHEMSvAc2BFDm+T8UXUIXE 
61jSOj/Dw1g2mSSdJFLNrB8T0hWaj7EX32sEd0KGQJmBsK4hMiUmV96ZmJFcJksiuwPcAbXLdvJt 
8R6T9KuVsxMBKt7QVYFd723o2hiPTCbc/2LrwAIpAIsinlOi238SyNvVqvsuRVe8EWKZo+KV9JZ9 
IQksz/vXNehGt/f4NCfGqZZiWndbp1DewISSLifqlKyGzghC49jwUu03HD86RRFYw6l6BNf0s9s2 
YyppEndTCJWruaX+YYEYxulVBY0E4hohidwWBCGg4wWKWEUYBnHuzaSTEzx6KQUZtRoxuISPGujE 
6fwb4oSExQ3FcURRszb+kwajXiptZk1kJrbF5GBYeGq74mFRth+pRaoEWWdGzz38Az6GXD+dg9Fh 
qCvj6Z5PzH80VoVso9YQVauOWavRdfIgDIxLenNx </X509Certificate> 
<X509IssuerSerial> 
<X509IssuerName>CN=Fina Demo CA 2020,O=Financijska agencija,C=HR </X509IssuerName> 
<X509SerialNumber>112670206482201164408252157595450884900 </X509SerialNumber> 
</X509IssuerSerial> 
</X509Data> 
</KeyInfo> 
</Signature> 
</tns:PromijeniNacPlacZahtjev> 
</soapenv:Body> 
</soapenv:Envelope>